PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_axidmac.h
/***************************************************************************//**
* \file cy_axidmac.h
* \version 1.0
*
* \brief
* The header file of the AXIDMAC driver.
*
********************************************************************************
* \copyright
* Copyright 2018-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_axidmac
* \{
* Configures the AXIDMA Controller block, channels and descriptors.
*
* The functions and other declarations used in this driver are in cy_axidmac.h.
* You can include cy_pdl.h to get access to all functions
* and declarations in the PDL.
*
* The AXIDMA Controller channel can be used in any project to transfer data
* without CPU intervention basing on a hardware trigger signal from another component.
*
* The AXIDMA Controller block has a set of registers, a base hardware address,
* and supports multiple channels. Many API functions for the AXIDMAC driver require
* a base hardware address and channel number.
* Ensure that you use the correct hardware address for the AXIDMA Controller block in use.
*
* Features:
* * Multiple channels (device specific).
* * Four priority levels for each channel.
* * Descriptor chaining.
* * Configurable source and destination addresses.
* * 1D memory copy, 2D memory copy, 3D memory copy descriptor types are supported.
* * Configurable input/output triggers and interrupts.
*
* \section group_axidmac_configuration Configuration Considerations
*
* To set up a AXIDMAC driver, initialize a descriptor,
* initialize and enable a channel, and enable the AXIDMAC block.
*
* To set up a descriptor, provide the configuration parameters for the
* descriptor in the \ref cy_stc_axidmac_descriptor_config_t structure. Then call the
* \ref Cy_AXIDMAC_Descriptor_Init function to initialize the descriptor in SRAM. You can
* modify the source and destination addresses dynamically by calling
* \ref Cy_AXIDMAC_Descriptor_SetSrcAddress and \ref Cy_AXIDMAC_Descriptor_SetDstAddress.
*
* To set up a AXIDMAC channel, provide a filled \ref cy_stc_axidmac_channel_config_t
* structure. Call the \ref Cy_AXIDMAC_Channel_Init function, specifying the channel
* number. Use \ref Cy_AXIDMAC_Channel_Enable to enable the configured AXIDMAC channel.
*
* Call \ref Cy_AXIDMAC_Channel_Enable for each AXIDMAC channel in use.
*
* When configured, another peripheral typically triggers the AXIDMAC channel. The trigger is
* connected to the AXIDMAC channel using the trigger multiplexer. The trigger multiplexer
* driver has a software trigger you can use in firmware to trigger the AXIDMAC channel. See the
* <a href="group__group__trigmux.html">Trigger Multiplexer</a> documentation.
*
* The following is a simplified structure of the AXIDMAC driver API interdependencies
* in a typical user application:
* \image html axidmac.png
*
* <B>NOTE:</B> Even if a AXIDMAC channel is enabled, it is not operational until
* the AXIDMAC block is enabled using function \ref Cy_AXIDMAC_Enable.\n
* <B>NOTE:</B> If the AXIDMAC descriptor is configured to generate an interrupt,
* the interrupt must be enabled using the \ref Cy_AXIDMAC_Channel_SetInterruptMask
* function for each AXIDMAC channel.
*
* <B>Scenario</B>: AXIDMAC with DMA descriptors, DMA config descriptors, source and destination buffer stored in memory
* <B>other then DTCM</B>(CM55 private MEMORY)  such as SOCMEM or FLASH
* \snippet axidmac/snippet/main.c snippet_Cy_AXIDMAC_Enable
* <B>Scenario</B>: AXIDMAC with DMA descriptors, DMA config descriptors, source and destination buffer stored in <B>DTCM memory</B>
* (CM55 private MEMORY), in this case address need to be remap to external master mapped address
* \snippet axidmac/snippet/main.c snippet_Cy_AXIDMAC_Enable_DTCM_MEM
*
* \section group_axidmac_more_information More Information.
* See the AXIDMAC chapter of the device technical reference manual (TRM).
*
* \section group_axidmac_changelog Changelog
*
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>The initial version.</td>
*     <td></td>
*   </tr>
* </table>

*
* \defgroup group_axidmac_macros Macros
* \defgroup group_axidmac_macros_interrupt_masks Interrupt Masks
* \defgroup group_axidmac_functions Functions
* \{
* \defgroup group_axidmac_block_functions Block Functions
* \defgroup group_axidmac_channel_functions Channel Functions
* \defgroup group_axidmac_descriptor_functions Descriptor Functions
* \}
* \defgroup group_axidmac_data_structures Data Structures
* \defgroup group_axidmac_enums Enumerated Types
*/

#if !defined (CY_AXIDMAC_H)
#define CY_AXIDMAC_H

#include "cy_device.h"

#if defined (CY_IP_MXSAXIDMAC) || defined (CY_IP_MXAXIDMAC)

#include "cy_syslib.h"
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>

#if defined(__cplusplus)
extern "C" {
#endif
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.1', 5, \
                             'The operand "" to the operator "&" does not have an essentially unsigned type.')
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.3', 5, \
                             'Implicit conversion from essential type "unsigned 32-bit int" to different or narrower essential type "signed 16-bit int".')
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.4', 5, \
                             'Essential type of the left hand operand (signed) is not the same as that of the right operand (unsigned).')
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 5, \
                             'Value extracted from _VAL2FLD macro will not exceed enum range.')

