PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_axidmac.h
/***************************************
*    In-line Function Implementation
***************************************/


/**
* \addtogroup group_axidmac_block_functions
* \{
*/


/*******************************************************************************
* Function Name: Cy_AXIDMAC_Enable
****************************************************************************//**
*
* Enables the AXIDMAC block.
*
* \param base
* The pointer to the hardware AXIDMAC block.
*
* \funcusage
* \snippet axidmac/snippet/main.c snippet_Cy_AXIDMAC_Enable
*
*******************************************************************************/
__STATIC_INLINE void Cy_AXIDMAC_Enable(AXI_DMAC_Type * base)
{
    AXIDMAC_CTL(base) |= AXI_DMAC_CTL_ENABLED_Msk;
}


/*******************************************************************************
* Function Name: Cy_AXIDMAC_Disable
****************************************************************************//**
*
* Disables the AXIDMAC block.
*
* \param base
* The pointer to the hardware AXIDMAC block.
*
* \funcusage
* \snippet axidmac/snippet/main.c snippet_Cy_AXIDMAC_Disable
*
*******************************************************************************/
__STATIC_INLINE void Cy_AXIDMAC_Disable(AXI_DMAC_Type * base)
{
    AXIDMAC_CTL(base) &= (uint32_t) ~AXI_DMAC_CTL_ENABLED_Msk;
}


/*******************************************************************************
* Function Name: Cy_AXIDMAC_GetAllChannelStatus
****************************************************************************//**
*
* Returns the channel enabled status of all channels in a AXIDMAC block. Example if return value is 7 then channel 0,1,2 are enabled.
*
* \param base
* The pointer to the hardware AXIDMAC block.
*
* \return
* Returns a bit-field with all of the currently enabled channels in the
* AXIDMAC block.
*
* \funcusage
* \snippet axidmac/snippet/main.c snippet_Cy_AXIDMAC_GetAllChannelStatus
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AXIDMAC_GetAllChannelStatus(AXI_DMAC_Type * base)
{
    return (_FLD2VAL(AXI_DMAC_STATUS_CH_EN, AXIDMAC_STATUS(base)));
}

#if defined (CY_IP_MXSAXIDMAC)
/*******************************************************************************
* Function Name: Cy_AXIDMAC_GetActiveChannel
****************************************************************************//**
*
* Returns the status of the active/pending channels of the AXIDMAC block.
*
* \param base
* The pointer to the hardware AXIDMAC block.
*
* \return
* Returns a bit-field with all of the currently active/pending secure channels in the
* AXIDMAC block.
*
* \funcusage
* \snippet axidmac/snippet/main.c snippet_Cy_AXIDMAC_GetActiveChannel
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AXIDMAC_GetActiveChannel(AXI_DMAC_Type const * base)
{
    return (_FLD2VAL(AXI_DMAC_ACTIVE_ACTIVE, AXIDMAC_ACTIVE(base)));
}

#elif defined (CY_IP_MXAXIDMAC)
/*******************************************************************************
* Function Name: Cy_AXIDMAC_GetActiveSecureChannel
****************************************************************************//**
*
* Returns the status of the active/pending secure channels of the AXIDMAC block.
*
* \param base
* The pointer to the hardware AXIDMAC block.
*
* \return
* Returns a bit-field with all of the currently active/pending secure channels
* in the AXIDMAC block.
*
* \funcusage
* \snippet axidmac/snippet/main.c snippet_Cy_AXIDMAC_GetActiveChannel
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AXIDMAC_GetActiveSecureChannel(AXI_DMAC_Type const * base)
{
    return (_FLD2VAL(AXI_DMAC_ACTIVE_SEC_ACTIVE, AXIDMAC_ACTIVE_SEC(base)));
}

/*******************************************************************************
* Function Name: Cy_AXIDMAC_GetActiveNonSecureChannel
****************************************************************************//**
*
* Returns the status of the active/pending non-secure channels of the AXIDMAC block.
*
* \param base
* The pointer to the hardware AXIDMAC block.
*
* \return
* Returns a bit-field with all of the currently active/pending non-secure channels
* in the AXIDMAC block.
*
* \funcusage
* \snippet axidmac/snippet/main.c snippet_Cy_AXIDMAC_GetActiveChannel
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AXIDMAC_GetActiveNonSecureChannel(AXI_DMAC_Type const * base)
{
    return (_FLD2VAL(AXI_DMAC_ACTIVE_NONSEC_ACTIVE, AXIDMAC_ACTIVE_NONSEC(base)));
}
#endif


/** \} group_axidmac_block_functions */


/**
* \addtogroup group_axidmac_descriptor_functions
* \{
*/


/*******************************************************************************
* Function Name: Cy_AXIDMAC_Descriptor_SetSrcAddress
****************************************************************************//**
*
* Sets the source address parameter for the specified descriptor.
*
* \param descriptor
* The descriptor structure instance.
*
* \param srcAddress
* The source address value for the descriptor.
*
* \funcusage
* \snippet axidmac/snippet/main.c snippet_Cy_AXIDMAC_Descriptor_SetterFunctions
*
*******************************************************************************/
__STATIC_INLINE void Cy_AXIDMAC_Descriptor_SetSrcAddress(cy_stc_axidmac_descriptor_t * descriptor, void const * srcAddress)
{
    descriptor->src = (uint32_t) srcAddress;
}


/*******************************************************************************
* Function Name: Cy_AXIDMAC_Descriptor_GetSrcAddress
****************************************************************************//**
*
* Returns the source address of the specified descriptor.
*
* \param descriptor
* The descriptor structure instance.
*
* \return
* The source address value of the descriptor.
*
* \funcusage
* \snippet axidmac/snippet/main.c snippet_Cy_AXIDMAC_Descriptor_GetterFunctions
*
*******************************************************************************/
__STATIC_INLINE void *Cy_AXIDMAC_Descriptor_GetSrcAddress(cy_stc_axidmac_descriptor_t const * descriptor)
{
    return ((void *) descriptor->src);
}


